/**
 * @file ex2-4-ReadC-String.cpp
 * @brief 사용자로부터 이름을 입력받아 출력하는 프로그램
 * @author 최수길
 * @date 2024-03-11
 *
 * 이 프로그램은 사용자로부터 이름을 입력받아, 그 이름을 출력합니다.
 * 한글 이름은 최대 5글자, 영문 이름은 최대 10글자까지 입력받을 수 있습니다.
 */

#include <iostream>
using namespace std;

/**
 * @brief 메인 함수
 * 
 * 사용자로부터 이름을 입력받아 출력하는 함수입니다.
 * 
 * @return int 프로그램 종료 시 반환되는 값
 */
int main() {
	cout << "이름을 입력하세요>>";

	char name[11]; // 한글은 5개 글자, 영문은 10까지 저장할 수 있다.
	cin >> name; // 키보드로부터 문자열을 읽는다.

	cout << "이름은 " << name << "입니다\n"; // 이름을 출력한다.
}